src/cf/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМасло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатГруппыГСМ/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.уатГруппыГСМ.Топливо);
	ДанныеВыбора.Добавить(Перечисления.уатГруппыГСМ.Талон);
	ДанныеВыбора.Добавить(Перечисления.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости);
	ДанныеВыбора.Добавить(Перечисления.уатГруппыГСМ.Электроэнергия);
		
КонецПроцедуры

#КонецОбласти
